Revit 2027 API
SolidOrShellTessellationControls.UseLevelOfDetail Method
 Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseLevelOfDetail()
Public Function UseLevelOfDetail As Boolean
public:
bool UseLevelOfDetail()
member UseLevelOfDetail : unit -> bool
Return Value
Boolean
See Also
Reference
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace